In [57]:
import pandas as pd

In [58]:
d={'Q1':[120,200,175],'Q2':[80,180,175],'Q3':[150,150,200],'Q4':[100,120,130]}

In [64]:
df=pd.DataFrame(d,index=['Entry1','Entry2','Entry3'])
df

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130

In [66]:
df.head(1)

         Q1  Q2   Q3   Q4
Entry1  120  80  150  100

In [70]:
df.tail(1)

         Q1   Q2   Q3   Q4
Entry3  175  175  200  130

In [72]:
df

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130

In [76]:
df.Q1.head(3)

Entry1    120
Entry2    200
Entry3    175
Name: Q1, dtype: int64

In [80]:
df.Q2.mean()

145.0

# Select a Row using Row label

In [81]:
df

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130

In [85]:
df.loc['Entry1']

Q1    120
Q2     80
Q3    150
Q4    100
Name: Entry1, dtype: int64

In [87]:
df.iloc[1:3]

         Q1   Q2   Q3   Q4
Entry2  200  180  150  120
Entry3  175  175  200  130

## Adding Columns

In [91]:
df['Annual sale']=df['Q1']+df['Q2']+df['Q3']+df["Q4"]
display(df)

         Q1   Q2   Q3   Q4  Annual sale
Entry1  120   80  150  100          450
Entry2  200  180  150  120          650
Entry3  175  175  200  130          680

# Removing Columns

In [96]:
df.drop(['Annual sale'],axis='columns')

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130

In [101]:
df.drop(['Entry2'])

         Q1   Q2   Q3   Q4  Annual sale
Entry1  120   80  150  100          450
Entry3  175  175  200  130          680

In [99]:
df.drop(df.index[1:3])

         Q1  Q2   Q3   Q4  Annual sale
Entry1  120  80  150  100          450

In [102]:
import pandas as pd
import numpy as np
s=pd.Series(np.random.randn(4))
print("Axes are:",s.axes)

Axes are: [RangeIndex(start=0, stop=4, step=1)]